SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 1960Driving

Comment (******************** General Information **********************
                Included in this section - Type, Shape, Size, Mass, etc
         ***************************************************************)

        Type ( Engine )
        WagonShape ( 1960Driving.s )
        Size  ( 2.620m 2.600m 16.69m )
        Mass ( 29t-uk ) Comment (* tare 26.6t-uk *)
        NumWheels ( 0 ) Comment (* all axles powered *)

Comment (************************* Coupler Information ************************
                Included in this section - Type, Spring, Buffer, Velocity, etc
         **********************************************************************)

 Comment ( Rear coupling )

 Coupling (
  Type ( bar )
  Spring (
    Stiffness ( 1e7N/m 1e7N/m )
    Break ( 3600kN 3600kN )
    r0 ( -5cm 0cm )))
    
    Couplinghasrigidconnection ( 1 )


 Comment ( Front coupling )

   Coupling (
     Type ( automatic )
       Spring (
        Stiffness ( 1e6N/m 5e6N/m )
        Break ( 3200kN 3200kN )
        r0 ( -5cm 0cm )))

Comment (******************************* Brakes *********************************************
                Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc
         ************************************************************************************)

BrakeEquipmentType ( "Triple_Valve, Distributor, auxilary_reservoir, Handbrake" )
BrakeSystemType ( "EP" )
    MaxBrakeForce ( 100kN ) Comment (* braked approx 80%, CoF 0.5 *)
    MaxHandbrakeForce ( 25kN )
    EmergencyResVolumeMultiplier ( 1.0 )
    TripleValveRatio ( 2.5 )
    MaxReleaseRate ( 10.0 )
    MaxApplicationRate ( 25.0 )
    MaxAuxilaryChargingRate ( 20.0 )
    EmergencyResChargingRate ( 20.0 )
    BrakeCylinderPressureForMaxBrakeBrakeForce ( 70psi )
    EmergencyResCapacity ( 2.064ft^3 )
    BrakePipeVolume ( 0.58ft^3 )

ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)    Comment (* Cast Iron Brakeshoes *)

Comment (**************** Resistance & SuperElevation **************************
                Included in this section - Wheelbase, gauge, etc
         ***********************************************************************)

    ORTSBearingType ( Roller )
    ORTSDavis_A ( 371 )
    ORTSDavis_B ( 10.3 )
    ORTSDavis_C ( 2.56 )        Comment (* Estimate based on SNCF calculation of resistance for EMU *)

    ORTSWagonFrontalArea ( 68ft^2 ) Comment (* Estimate based on dimensions *)
    ORTSDavisDragConstant ( 0.0028 )
    ORTSTrailLocomotiveResistanceFactor ( 0.211 ) Comment (* Ratio of SNCF calculated resistances *)

    CentreOfGravity ( 0m 2.25m -0.380m )
    ORTSTrackGauge ( 4ft 8.5in )
    ORTSUnbalancedSuperelevation ( 6in )
    ORTSRigidWheelBase ( 6ft 3in )

Comment (************************ Lights (If used) ***********************************
                Included in this section - Type, Colour, Location, Size, Control, etc
         *****************************************************************************)

	Lights ( 9

		comment ( DM West units are lead units and only have front lights specified )
		comment ( Player lights )
		comment ( Headlight 1 = All off )
		comment ( Headlight 2/3 = bright front lights and sphere light )
		comment ( Unit 2/3 = front/back )
		comment ( Control and Service values ignored for player )

		Light	(
			comment( Sphere of light bright HL=2 )
			Type( 1 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			Cycle	( 0 )
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			States ( 1
				State	(
					Duration ( 0.0 )
					LightColour ( a0a0a050 )
					Position ( 0.0 1.28 3.00 )
					Transition ( 0 )
					Radius ( 100.0 )
					Angle ( 15.0 )
				)
			)
		)
			
		Light	(
			comment( Sphere of light bright HL=3 )
			Type( 1 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
			)
			Cycle	( 0 )
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			States ( 1
				State	(
					Duration ( 0.0 )
					LightColour ( a0a0a050 )
					Position ( 0.0 1.28 3.00 )
					Transition ( 0 )
					Radius ( 100.0 )
					Angle ( 15.0 )
				)
			)
		)
			
		Light	(
			comment( Head light right HL=2 )
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			Cycle	( 0 )
			States ( 1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffc0 )
					Position ( 0.88 1.28 7.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
				)
			)
		)
			
		Light	(
			comment( Head light right HL=3 )
			Type( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			Cycle	( 0 )
			States ( 1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffc0 )
					Position ( 0.88 1.28 7.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
				)
			)
		)
			
		Light	(
			comment( Head light left HL=2)
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			Cycle	( 0 )
			States ( 1 
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffc0 )
					Position ( 0.70 1.28 7.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
				)
			)
		)
		
		Light	(
			comment( Head light left HL=3)
			Type( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			Cycle	( 0 )
			States ( 1 
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffc0 )
					Position ( 0.70 1.28 7.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
				)
			)
		)
		
		comment ( AI Lights )
		comment ( Front/rear and sphere lights on if Control 1 and Service 2 = AI unit, in service )
		comment ( Only Stabling light on if Control 1 and Service 1 = AI unit, out of service )
		comment ( Unit 2/3 = front/back )
		comment ( Headlight value ignored if AI, always bright )

		Light	(
			comment( Sphere of light bright )
			Type( 1 )
			Conditions (
				Control ( 1 )
				Service ( 2 )
				Unit ( 2 )
			)
			Cycle	( 0 )
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			States ( 1
				State	(
					Duration ( 0.0 )
					LightColour ( a0a0a060 )
					Position ( 0.0 1.28 3.00 )
					Transition ( 0 )
					Radius ( 100.0 )
					Angle ( 15.0 )
				)
			)
		)
			
		Light	(
			comment( Head light right )
			Type( 0 )
			Conditions (
				Control ( 1 )
				Service ( 2 )
				Unit ( 2 )
				)
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			Cycle	( 0 )
			States ( 1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffc0 )
					Position ( 0.88 1.28 7.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
				)
			)
		)
			
		Light	(
			comment( Head light left )
			Type( 0 )
			Conditions (
				Control ( 1 )
				Service ( 2 )
				Unit ( 2 )
			)
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			Cycle	( 0 )
			States ( 1 
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffc0 )
					Position ( 0.70 1.28 7.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
				)
			)
		)
		
	)

 Comment (******************** Freight Animations (If used) *******************
                Included in this section - Freight Animation information, etc
         *********************************************************************)
	
ORTSFreightAnims
	(
	MSTSFreightAnimEnabled(0)
	
	FreightAnimStatic
	(
		SubType ( Default )
		Shape(  .\\Front_Destination\\centraldestination.s 0.1 0.1 )
		Offset( 0.0, 0.0, 0.0 )
	)
		
)

Comment (********************* Passenger View (If used) ******************
                Included in this section - File, Location, Direction, etc
         *****************************************************************)

Comment (********************** Micellaneous Information **********
                      Included in this section - Name, Sounds, etc
          *********************************************************)

  Sound ( "LUReng.sms" )
  PassengerCapacity( 42 )
 
Comment (*****************  End Wagon Section ************************))

Engine ( 1960Driving
 Wagon ( 1960Driving )

    Comment (************************ General Information ****************
                      Included in this section - Wheels, sanding, etc
              ************************************************)

    Type ( Electric )
    WheelRadius ( 15.5in )
    NumWheels ( 4 ) Comment (* all axles powered *)
    Sanding ( 10mph )
    ORTSDriveWheelWeight ( 29t-uk )

    Comment (****************** Electrical Equipment ****************)

    MaxVelocity ( 45mph )
    MaxCurrent ( 400A )
    MaxForce ( 42kN )

Comment ( Lower rate of acceleration set for Series - for use in low adhesion )
Comment ( Workaround for OpenRails as rate switch can not be included )

Comment ( Coasting Control set for Shunt, Series and Parallel )
Comment ( Workaround for OpenRails as Coasting Flag can not be included )

Comment ( Additional notch added at 125% for Weak Field )
Comment ( Workaround for OpenRails as Weak Field Flag can not be included )

ORTSMaxTractiveForceCurves(	
0 (	
0.00	0
22.13	0
  )	
0.25 (	
0.00	18848
0.38	28105
0.76	8356
1.53	2484
3.06	739
5.10	302
7.22	164
10.06	92
11.80	0
14.08	0
16.09	0
18.10	0
20.12	0
22.13	0
  )	
0.5 (	
0.00	18848
0.57	14053
0.58	34763
1.15	14053
1.16	27860
1.72	14053
1.73	24408
2.29	14053
2.30	22337
2.87	14053
2.88	20956
3.44	14053
3.45	19970
4.01	14053
4.02	19230
4.59	14053
4.60	18655
5.16	14053
5.17	18195
5.73	14053
7.64	8356
13.41	3124
13.45	0
14.08	0
16.09	0
18.10	0
20.12	0
22.13	0
  )	
	
	
1.0 (	
0.00	18848
0.38	28105
0.39	41790
0.76	28105
0.77	37228
1.15	28105
1.16	34947
1.53	28105
1.54	33579
1.91	28105
1.92	32667
2.29	28105
2.30	32015
2.68	28105
2.69	31526
3.06	28105
3.07	31146
3.44	28105
3.45	30842
3.82	28105
3.83	30850
4.25	28105
4.26	30600
4.67	28105
4.68	30392
5.10	28105
5.11	30216
5.52	28105
5.53	30065
5.95	28105
5.96	29935
6.37	28105
6.38	29820
6.79	28105
6.80	29720
7.22	28105
7.23	29630
10.06	19230
13.41	10509
13.45	0
14.08	0
16.09	0
18.10	0
20.12	0
22.13	0
  )	
1.25 (	
0.00	18848
0.38	28105
0.39	41790
0.76	28105
0.77	37228
1.15	28105
1.16	34947
1.53	28105
1.54	33579
1.91	28105
1.92	32667
2.29	28105
2.30	32015
2.68	28105
2.69	31526
3.06	28105
3.07	31146
3.44	28105
3.45	30842
3.82	28105
3.83	30850
4.25	28105
4.26	30600
4.67	28105
4.68	30392
5.10	28105
5.11	30216
5.52	28105
5.53	30065
5.95	28105
5.96	29935
6.37	28105
6.38	29820
6.79	28105
6.80	29720
7.22	28105
7.23	29630
7.87	27283
7.88	27220
10.06	27283
11.80	20219
11.81	20201
14.08	16481
16.09	13185
18.10	9889
20.12	6593
22.13	3296
  )	
)

Comment ( ************************** Brake System *********************************************
                      Included in this section - Compressor, Reservoir, Application rates, etc
         ************************************************************************************** )

Comment ( *** Braking system *** )

BrakesEngineBrakeType ( "EP_brake" )
BrakesTrainBrakeType ( "EP" )
    BrakesEngineControllers( "Train" )

Comment ( == Compressor, Reservoir and General == )
    AirBrakesMainMaxAirPressure( 105 )
    AirBrakesCompressorRestartPressure( 90 )
    ORTSBrakePipeChargingRate ( 150 )
    AirBrakesMainResVolume( 16ft^3 )
    ORTSMainResChargingRate ( 0.575 )
    TrainPipeLeakRate ( 0.0833 )

Comment ( == Automatic Brake valve - Train == )
    TrainBrakesControllerMaxSystemPressure( 70psi )
    TrainBrakesControllerMaxQuickReleaseRate( 24psi/s )
    TrainBrakesControllerMaxReleaseRate( 4.0psi/s )
    TrainBrakesControllerMaxApplicationRate( 3.0psi/s )
    TrainBrakesControllerEmergencyApplicationRate( 48psi/s )
    TrainBrakesControllerFullServicePressureDrop( 24 )
    TrainBrakesControllerMinPressureReduction( 6 )

Comment (******************* Train Control Systems (If used) ***********************************************
                      Included in this section - Monitoring of Overspeed, Emergency Braking, Vigilance, etc
         ***************************************************************************************************)

    Comment (* vigilance device is dead-man's handle *)

    Comment (* LT Trip cock script should be added * )

  Comment (************************** Engine Controls **********************************************
                      Included in this section - Controllers for Regulator, Reverser, Brakes, etc
         *****************************************************************************************)

    EngineControllers (

Throttle ( 0 1.25 1 0
NumNotches ( 5
Notch (	0.00	0	 Dummy )
Notch (	0.25	0	 Dummy )
Notch (	0.50	0	 Dummy )
Notch (	1.00	0	 Dummy )
Notch ( 1.25    0        Dummy ) ) )

Brake_Train ( 0 1 0.05 0.15
NumNotches ( 5
Notch ( 0.0  0 TrainBrakesControllerReleaseStart )
Notch ( 0.1  1 TrainBrakesControllerEPApplyStart )
Notch ( 0.7  0 TrainBrakesControllerHoldStart )
Notch ( 0.8  0 TrainBrakesControllerFullServiceStart )
Notch ( 0.9  0 TrainBrakesControllerEmergencyStart )))

      DirControl ( -1 0 1 1 )
      Sanding ( 0 1 0 )
      Horn ( 0 1 0 )
      AWS ( 0 1 0 )
      PantographToggle1 ( 0 1 1 )
      Wipers ( 0 1 0 )
      Headlights ( 0 1 0 )
    )

 Comment (********************** Micellaneous Information ****************************
                      Included in this section - Alternate Views, Sounds, Names, etc
         ****************************************************************************)

	CabView ( 1959.cvf )
	HeadOut ( -1.5 2.2 6.5 )
        Sound ( "LURcab.sms" )
    	Name ( "1960 Tube Stock Driving Car" )


  Comment (************************* Stock Description *****************************************
                      Included in this section - Stock Description, Operating Procedures, etc
         *************************************************************************************)

    	Description (
	"The London Transport 1960 Tube Stock was built by Cravens for use on the "+
	"Central line and used refurbised Standard Stock trailing cars."+
	"Power source: 3rd and 4th rail electric lines\n\n"  )



    EngineOperatingProcedures ( "To move forward\n"+
        "1. Press the P key to close the main circuit breaker\n"+
        "2. Press the W key to move the Reverser to Forward.\n"+
        "3. Press the ; (SEMICOLON) key to release the train brakes.\n"+
        "4. Press the D key to move increase the Throttle setting.\n\n"+
        "Acceleration is automatic, there are four controller positions.\n"+
        "OFF.\n"+
        "Shunt - used only for shunting. You should not leave the controller in this notch.\n"+
        "SERIES - the unit will automatically notch up through the 7 series notches.\n"+
        "PARALLEL - the unit will notch up through 7 series and 6 parallel notches to reach full speed.\n\n"+
        "Always return the throttle to OFF (0%) when coasting.\n\n"+
        "There was a separate control to allow WEAK FIELD running where permitted.\n"+
        "As this is not currently possible in OpenRails an extra notch has been added as on the BR controllers.\n"+
        "(100%) throttle represents FULL PARALLEL in is the highest setting permitted in tunnels.\n"+
        "(125%) throttle represents FULL PARALLEL + WEAK FIELD and should only be used where speed limits permit.\n"+
        "These units also had a Coasting Control feature that could be used to limit the "+
        "speed to 30 mph for use in tunnel sections.\n"+
        "It is not possible to include this as a separate control in OR, so Coasting Control "+
        "has been included when not in Weak Field mode.\n\n"+
        "The RATE SWITCH gives a lower rate of acceleration for use in conditions of low adhesion.\n"+
        "The rate switch can not be included in OpenRails.\n"+
        "The SERIES ( 50% ) position has been set to the lower acceleration rate to allow for this.\n\n"+
        "Always return the throttle to OFF (0%) when coasting.\n\n"+
    "To slow the train\n"+
    "1. If you are running in the FULL PARALLEL (100%)notch use the A key to reduce power to the FULL SERIES (50%) notch.\n"+
    "3.	Use the brakes to further reduce speed if desired.\n"+
    "4. Use the A key to return the throttle to OFF (0%) before applying any brakes.\n\n"+
    "To apply the train brakes\n"+
    "1.	Press the ' (APOSTROPHE) key to apply the train brake." )


)